name: "ensemble_model"
platform: "ensemble"
max_batch_size: 0

input [
  {
    name: "input_ids"
    data_type: TYPE_INT64
    dims: [ 50, 128 ]
  },
  {
    name: "attention_mask"
    data_type: TYPE_INT64
    dims: [ 50, 128 ]
  }
]

output [
  {
    name: "PREDICTION"
    data_type: TYPE_INT64
    dims: [ 1 ]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "nli_deberta"
      model_version: -1
      input_map {
        key: "input_ids"
        value: "input_ids"
      }
      input_map {
        key: "attention_mask"
        value: "attention_mask"
      }
      output_map {
        key: "confidence_vector"
        value: "confidence_vector"
      }
    },
    {
      model_name: "xgboost_classifier"
      model_version: -1
      input_map {
        key: "float_input"
        value: "confidence_vector"
      }
      output_map {
        key: "label"
        value: "PREDICTION"
      }
    }
  ]
}